# Python Pandas Tutorial (Part 2):

  - DataFrame Basics Tutorial
  - Selecting Rows and Columns

In [12]:
#create a dataframe
people = {
    'F_name' : ['Ali','Nada','Mohammed','Eman'],
    'L_name' : ['Bassem','Emad','Ahmed','Mustafa'],
    'Age' : [25,21,22,29],
    'Phone' : ['01215854781','01068723449','01135711964','01522741395']
}

In [13]:
#show a specific column frome dataframe
people['F_name']

['Ali', 'Nada', 'Mohammed', 'Eman']

In [14]:
# show the data of dataframe
import pandas as pd
data = pd.DataFrame(people)

data

     F_name   L_name  Age        Phone
0       Ali   Bassem   25  01215854781
1      Nada     Emad   21  01068723449
2  Mohammed    Ahmed   22  01135711964
3      Eman  Mustafa   29  01522741395

In [15]:
#show a specific column frome data
data['F_name']

0         Ali
1        Nada
2    Mohammed
3        Eman
Name: F_name, dtype: object

In [16]:
data.F_name

0         Ali
1        Nada
2    Mohammed
3        Eman
Name: F_name, dtype: object

In [7]:
# show multiple columns
data[['F_name','Age']]

     F_name  Age
0       Ali   25
1      Nada   21
2  Mohammed   22
3      Eman   29

In [8]:
# to get a row, we can use the (loc) or (iloc) indexers
data.iloc[0]

F_name            Ali
L_name         Bassem
Age                25
Phone     01215854781
Name: 0, dtype: object

In [9]:
# to get multiple row
data.iloc[[0,1]]

  F_name  L_name  Age        Phone
0    Ali  Bassem   25  01215854781
1   Nada    Emad   21  01068723449

In [10]:
# to get multiple row at specific column(phone)
data.iloc[[0,1],3]

0    01215854781
1    01068723449
Name: Phone, dtype: object

In [11]:
# to get multiple row and multiple column(phone) by use (loc)
data.loc[[0,1],['Phone','F_name']]

         Phone F_name
0  01215854781    Ali
1  01068723449   Nada

In [17]:
# To check the type of this F_name column
type(data['F_name'])

pandas.core.series.Series

In [20]:
#To drop a specific row from a Dataframe
data.drop(3,inplace=True)

In [21]:
# data after drop
data

     F_name  L_name  Age        Phone
0       Ali  Bassem   25  01215854781
1      Nada    Emad   21  01068723449
2  Mohammed   Ahmed   22  01135711964

In [37]:
#To drop a specific column from a Dataframe
data.drop('L_name', inplace=True, axis=1)

data

     F_name  Age        Phone
0       Ali   25  01215854781
1      Nada   21  01068723449
2  Mohammed   22  01135711964

In [39]:
# To add a new column to dataframe
import numpy as np
data['L_name'] = np.array(['Bassem','Emad','Ahmed',])
data

     F_name  Age        Phone  L_name
0       Ali   25  01215854781  Bassem
1      Nada   21  01068723449    Emad
2  Mohammed   22  01135711964   Ahmed

- (inplace=True) -> To save changes in data

# Indexes 
- How to Set, Reset, and Use Indexes

In [23]:
data.set_index('F_name')

          L_name  Age        Phone
F_name
Ali       Bassem   25  01215854781
Nada        Emad   21  01068723449
Mohammed   Ahmed   22  01135711964

In [25]:
data

     F_name  L_name  Age        Phone
0       Ali  Bassem   25  01215854781
1      Nada    Emad   21  01068723449
2  Mohammed   Ahmed   22  01135711964

In [32]:
data.set_index('F_name',inplace=True)

In [33]:
data

          L_name  Age        Phone
F_name
Ali       Bassem   25  01215854781
Nada        Emad   21  01068723449
Mohammed   Ahmed   22  01135711964

In [34]:
data.shape

(3, 3)

In [28]:
data.index

Index(['Ali', 'Nada', 'Mohammed'], dtype='object', name='F_name')

In [29]:
data.loc['Nada']

L_name           Emad
Age                21
Phone     01068723449
Name: Nada, dtype: object

In [30]:
data.loc['Nada','Age']

21

In [35]:
# to remove the changes we use
data.reset_index(inplace=True)

data

     F_name  L_name  Age        Phone
0       Ali  Bassem   25  01215854781
1      Nada    Emad   21  01068723449
2  Mohammed   Ahmed   22  01135711964

In [36]:
data.shape

(3, 4)

# To Create Dataframe and take it from the User

In [40]:
columns = []
data = dict()

num = int(input('Please enter the number of columns : '))
while(num > 0):
    columns.append(input('Please enter the column name : '))
    num -= 1

for i in columns:
    data[i] =[]

rows = int(input('Please enter the number of rows : '))
while(rows>0):
    for i in data:
        value = input(f'Please enter the value of {i} : ')
        data[i].append(value)

    rows -= 1

dataframe = pd.DataFrame(data)    
dataframe

    Name Age Salary
0    Ali  23   2340
1   Emad  22   4000
2  Ahmed  28   6500